articles/2021-SOA-Rest-Micro/SOA-Rest-Micro.org
#+TITLE: Arquitetura Orientada a Serviços: serviços Web, microsserviços e REST
#+AUTHOR: Ivan Salvadori
#+DESCRIPTION: Review

#+INFOJS_OPT: path:../../HtmlTemplate/ccReport.js
#+HTML_HEAD: <link id="tema" rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />


* Introdução

* Arquitetura Orientada a Serviços
   A arquitetura SOA (Service Oriented Architecture), pode ser definida como um paradigma para implementação e manutenção de processos de negócio em sistemas distribuídos.
 Não é uma arquitetura propriamente dita, nem mesmo uma tecnologia específica; a melhor definição seria estilo ou conceito, flexível a ponto de ser aplicável a diferentes circunstâncias; por essa razão é caracterizada como paradigma.
 SOA está fundamentada sobre três pilares: serviços, interoperabilidade e baixo acoplamento. Serviços representam uma funcionalidade de negócio, por exemplo: armazenar ou carregar dados de clientes.
 Interoperabilidade é a infraestrutura necessária para facilitar a distribuição dos processos de negócio através de sistemas distribuídos, com diferentes plataformas e tecnologias.
 Entende-se por baixo acoplamento o baixo nível de dependência entre sistemas, pois os impactos causados por evolução e manutenção devem ser minimizados.
 SOA pode ser implementado através de Web Services.
 Entretanto, a adoção de SOA não está necessariamente vinculada a uma determinada tecnologia. 
SOA é uma forma de arquitetura de tecnologia que adere aos princípios de orientação a serviços.
Quando realizada através da plataforma de tecnologia de serviços da Web, a SOA estabelece o potencial para apoiar e promover esses princípios em todo o processo de negócios e domínios de automação de uma empresa.

Existem muitas definições diferentes para o  termo SOA. No entanto, pelo menos todas as definições concordam que SOA é um paradigma para maior flexibilidade.  Thomas Erl define SOA como um paradigma de design pretendido para a criação de unidades de lógica de solução que são individualmente moldadas para que possam ser coletivamente e repetidamente utilizadas para realizar um conjunto específico de objetivos. OASIS define SOA como um paradigma para organizar e utilizar recursos distribuídos que podem estar sob o controle de diferentes domínios. 
SOA não é uma arquitetura concreta: é algo que leva a uma arquitetura concreta. Pode-se definir como estilo, paradigma, conceito, perspectiva, filosofia ou representação. Ou seja, SOA não é uma ferramenta ou estrutura concreta que pode ser adquirida. É uma abordagem, um modo de pensar, um sistema de valores que leva a certas decisões concretas ao projetar uma arquitetura de software. 
SOA incentiva que unidades de lógica individuais existam de forma autônoma, mas não isoladas umas das outras. No contexto SOA, unidades de lógica são conhecidas como serviços. A SOA contemporânea representa uma arquitetura aberta, ágil, extensível e federada, composta por serviços autônomos, diversos, interoperáveis, detectáveis e potencialmente reutilizáveis, implementados como serviços Web. SOA estabelece uma abstração de lógica e tecnologia de negócios que podem introduzir mudanças na modelagem de processos de negócios e na arquitetura técnica, resultando em um acoplamento flexível entre esses modelos.

Aplicações que adotam a arquitetura SOA devem possuir certas propriedades que atendam aos requisitos fundamentais de aplicações orientadas a serviços. Os três pilares serviços, interoperabilidade e baixo acoplamento. Se desdobram em uma série de características que ajudam ainda mais a distinguir SOA de outros modelos arquiteturais.

** Abstração
Software development is the art of abstraction. We have to abstract reality in such a way that only the relevant aspects of a problem are handled. Beyond what is described in the service contract, services hide logic from the outside world.

** Autonomia
O princípio da autonomia define que serviços sejam tão independentes e autocontidos quanto possível. SOA se baseia e expande esse princípio promovendo o conceito de autonomia em todos os ambientes de solução e na empresa. Aplicativos compostos por serviços autônomos, por exemplo, podem ser vistos como serviços compostos e autossuficientes que exercem seu próprio autogoverno em ambientes de integração orientados a serviços.

** Composição de Serviços
Composability is a deep-rooted characteristic of SOA that can be realized on different levels. For example, by fostering the development and evolution of composable services, SOA supports the automation of flexible and highly adaptive business processes. As previously mentioned, services exist as independent units of logic. A business process can therefore be broken down into a series of services, each responsible for executing a portion of the process.
Mecanismos para descrição, descoberta e invocação de serviços

** Baseado em orquestração



