articles/2021-SOA-Rest-Micro/SOA-Rest-Micro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 29/09/2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arquitetura Orientada a Serviços: serviços Web, microsserviços e REST</title>
<meta name="author" content="Ivan Salvadori" />
<meta name="description" content="Review" />
<meta name="generator" content="Org Mode" />
<link id="tema" rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />


</head>
<body>
<div id="content" class="content">
<h1 class="title">Arquitetura Orientada a Serviços: serviços Web, microsserviços e REST</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga1334a4">1. Introdução</a></li>
<li><a href="#org75c21b4">2. Arquitetura Orientada a Serviços</a>
<ul>
<li><a href="#org70f2190">2.1. Abstração</a></li>
<li><a href="#orge601f25">2.2. Autonomia</a></li>
<li><a href="#org43db365">2.3. Composição de Serviços</a></li>
<li><a href="#org9ef604a">2.4. Baseado em orquestração</a></li>
</ul>
</li>
<li><a href="#orgb11f4df">3. Modelagem de serviços</a>
<ul>
<li><a href="#org7cd04aa">3.1. Principios Arquiteturais REST</a>
<ul>
<li><a href="#org6f54cd7">3.1.1. Identificação e endereçamento de recursos</a></li>
<li><a href="#org9612ac2">3.1.2. Multiplos formatos de representação</a></li>
<li><a href="#orga4b00e9">3.1.3. Interface Uniforme</a></li>
<li><a href="#org6818860">3.1.4. Mensagens autocontidas</a></li>
<li><a href="#org77a3fa5">3.1.5. HATEOAS</a></li>
</ul>
</li>
<li><a href="#org612b9f6">3.2. Arquitetura de microseviços</a></li>
</ul>
</li>
<li><a href="#org5f88af0">4. Conclusões</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga1334a4" class="outline-2">
<h2 id="orga1334a4"><span class="section-number-2">1.</span> Introdução</h2>
</div>

<div id="outline-container-org75c21b4" class="outline-2">
<h2 id="org75c21b4"><span class="section-number-2">2.</span> Arquitetura Orientada a Serviços</h2>
<div class="outline-text-2" id="text-2">
<p>
   A arquitetura SOA (Service Oriented Architecture), pode ser definida como um paradigma para implementação e manutenção de processos de negócio em sistemas distribuídos.
 Não é uma arquitetura propriamente dita, nem mesmo uma tecnologia específica; a melhor definição seria estilo ou conceito, flexível a ponto de ser aplicável a diferentes circunstâncias; por essa razão é caracterizada como paradigma.
 SOA está fundamentada sobre três pilares: serviços, interoperabilidade e baixo acoplamento. Serviços representam uma funcionalidade de negócio, por exemplo: armazenar ou carregar dados de clientes.
 Interoperabilidade é a infraestrutura necessária para facilitar a distribuição dos processos de negócio através de sistemas distribuídos, com diferentes plataformas e tecnologias.
 Entende-se por baixo acoplamento o baixo nível de dependência entre sistemas, pois os impactos causados por evolução e manutenção devem ser minimizados.
 SOA pode ser implementado através de Web Services.
 Entretanto, a adoção de SOA não está necessariamente vinculada a uma determinada tecnologia. 
SOA é uma forma de arquitetura de tecnologia que adere aos princípios de orientação a serviços.
Quando realizada através da plataforma de tecnologia de serviços da Web, a SOA estabelece o potencial para apoiar e promover esses princípios em todo o processo de negócios e domínios de automação de uma empresa.
</p>

<p>
Existem muitas definições diferentes para o  termo SOA. No entanto, pelo menos todas as definições concordam que SOA é um paradigma para maior flexibilidade.  Thomas Erl define SOA como um paradigma de design pretendido para a criação de unidades de lógica de solução que são individualmente moldadas para que possam ser coletivamente e repetidamente utilizadas para realizar um conjunto específico de objetivos. OASIS define SOA como um paradigma para organizar e utilizar recursos distribuídos que podem estar sob o controle de diferentes domínios. 
SOA não é uma arquitetura concreta: é algo que leva a uma arquitetura concreta. Pode-se definir como estilo, paradigma, conceito, perspectiva, filosofia ou representação. Ou seja, SOA não é uma ferramenta ou estrutura concreta que pode ser adquirida. É uma abordagem, um modo de pensar, um sistema de valores que leva a certas decisões concretas ao projetar uma arquitetura de software. 
SOA incentiva que unidades de lógica individuais existam de forma autônoma, mas não isoladas umas das outras. No contexto SOA, unidades de lógica são conhecidas como serviços. A SOA contemporânea representa uma arquitetura aberta, ágil, extensível e federada, composta por serviços autônomos, diversos, interoperáveis, detectáveis e potencialmente reutilizáveis, implementados como serviços Web. SOA estabelece uma abstração de lógica e tecnologia de negócios que podem introduzir mudanças na modelagem de processos de negócios e na arquitetura técnica, resultando em um acoplamento flexível entre esses modelos.
</p>

<p>
Aplicações que adotam a arquitetura SOA devem possuir certas propriedades que atendam aos requisitos fundamentais de aplicações orientadas a serviços. Os três pilares serviços, interoperabilidade e baixo acoplamento. Se desdobram em uma série de características que ajudam ainda mais a distinguir SOA de outros modelos arquiteturais.
</p>
</div>

<div id="outline-container-org70f2190" class="outline-3">
<h3 id="org70f2190"><span class="section-number-3">2.1.</span> Abstração</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Software development is the art of abstraction. We have to abstract reality in such a way that only the relevant aspects of a problem are handled. Beyond what is described in the service contract, services hide logic from the outside world.
</p>
</div>
</div>

<div id="outline-container-orge601f25" class="outline-3">
<h3 id="orge601f25"><span class="section-number-3">2.2.</span> Autonomia</h3>
<div class="outline-text-3" id="text-2-2">
<p>
O princípio da autonomia define que serviços sejam tão independentes e autocontidos quanto possível. SOA se baseia e expande esse princípio promovendo o conceito de autonomia em todos os ambientes de solução e na empresa. Aplicativos compostos por serviços autônomos, por exemplo, podem ser vistos como serviços compostos e autossuficientes que exercem seu próprio autogoverno em ambientes de integração orientados a serviços.
</p>
</div>
</div>

<div id="outline-container-org43db365" class="outline-3">
<h3 id="org43db365"><span class="section-number-3">2.3.</span> Composição de Serviços</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Composability is a deep-rooted characteristic of SOA that can be realized on different levels. For example, by fostering the development and evolution of composable services, SOA supports the automation of flexible and highly adaptive business processes. As previously mentioned, services exist as independent units of logic. A business process can therefore be broken down into a series of services, each responsible for executing a portion of the process.
Mecanismos para descrição, descoberta e invocação de serviços
</p>
</div>
</div>

<div id="outline-container-org9ef604a" class="outline-3">
<h3 id="org9ef604a"><span class="section-number-3">2.4.</span> Baseado em orquestração</h3>
</div>
</div>
