articles/2021-SOA-Rest-Micro/SOA-Rest-Micro.html



<div id="outline-container-orgb11f4df" class="outline-2">
<h2 id="orgb11f4df"><span class="section-number-2">3.</span> Modelagem de serviços</h2>
<div class="outline-text-2" id="text-3">
<p>
Web APIs REST representam uma alternativa leve para a implementação de serviços.
Um serviço pode ser compreendido como um artefato de software que disponibiliza um conjunto de funcionalidades por meio de uma API, publicadas através de um contrato de serviço.
Web APIs podem ser modeladas de diversas maneiras.
Entretanto, é possível classificar a modelagem de Web APIs em três formas distintas.
</p>

<p>
WEB API apenas como interface de acesso.
Web APIs modeladas dessa maneira adotam parcialmente os princípios arquiteturais REST. Essas implementações buscam principalmente tornar acessível o conjunto de suas funcionalidades. É comum os casos onde aplicações originalmente implementadas como desktop serem adaptadas para expor suas funcionalidades através de uma Web API.
É importante destacar que não há nada de errado nesta prática.
Entretanto, estas implementações geralmente possuem baixa aderência aos princípios REST, principalmente quanto a modelagem de funcionalidades em termos de recursos, suas representações e principalmente quanto ao uso de controles hipermídia.
</p>

<p>
A segunda forma de modelagem compreende Web services REST que implementam suas funcionalidades em termos de recursos Web. Estas implementações seguem os princípios arquiteturas com mais rigor.
De forma geral, as implementações definem explicitamente contextos como descritos na metodologia Domain Driven Design, proposta por Eric Evans em 2016.
Um contexto define explicitamente as fronteiras de um determinado domínio de aplicação.
As fronteiras são definidas através de uma barreira lógica que delimita os elementos que estão fortemente relacionados.
Entretanto, Web APIs classificadas neste grupo disponibilizam todas as funcionalidades através de um único artefato de software, também conhecida como aplicações monolíticas.
E por essa razão, a modificação de um único contexto implica na geração de uma nova versão de toda a Web API.
</p>

<p>
Por fim, a terceira forma de modelagem compreende Web APIs modeladas em forma de microserviços.
Com o objetivo de tornar os serviços disponibilizados na Internet e em ambientes de nuvem computacional mais coesos e menos acoplados, os microservices estão substituindo as implementações tradicionais, conhecidas como aplicações monolíticas.
Dessa forma, os microservices disponibilizam apenas um subconjunto das funcionalidades que compõem um contexto de negócio bem definido.
O resultado é a fragmentação dos dados e das funcionalidades em diversos componentes que se comunicam e operam em conjunto.
Entretanto, a adoção de microservices adiciona uma complexidade significativa, pois são necessários maiores esforços para comunicação e cooperação dos diversos serviços na realização das funcionalidades.
</p>

<p>
Microservices são serviços independentes e pequenos.
Cada microservice deve ser desenvolvido e mantido por um único time de desenvolvimento.
Isso é importante para garantir que um microservice seja independente dos demais e também independente dos demais times de desenvolvimento.
O foco principal dos microservices é atingir a excelência dos requisitos de software presentes em um domínio bem definido, que pode estar dividido em diversos contextos (bounded context).
Os microserviços que implementam um único contexto mantêm unidos os elementos que sofrem alterações pelos mesmos motivos, sendo assim, podem ser implementados e implantados de forma independente.
</p>
</div>



<div id="outline-container-org7cd04aa" class="outline-3">
<h3 id="org7cd04aa"><span class="section-number-3">3.1.</span> Principios Arquiteturais REST</h3>
<div class="outline-text-3" id="text-3-1">
<p>
REST é uma coleção de princípios e restrições arquiteturais para o desenvolvimento de aplicações distribuídas na Web.
REST adota o paradigma cliente-servidor e constitue em uma abordagem leve para o desenvolvimento de Web Services, que busca simplicidade e baixo acoplamento.
A seguir, são apresentados os detalhes de cada restrição arquitetural que compõem o desenvolvimento de Web APIs REST.
</p>
</div>

<div id="outline-container-org6f54cd7" class="outline-4">
<h4 id="org6f54cd7"><span class="section-number-4">3.1.1.</span> Identificação e endereçamento de recursos</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Recursos formam a base dos princípios REST e podem ser qualquer informação que se deseje tornar acessível a clientes remotos, e que são endereçados através de um identificador único, denominado URI (Uniform Resource Identifier).
Recursos podem ser uma lista de filmes em cartaz em um cinema, comentários de um blog, uma página pessoal ou um perfil de um usuário de uma rede social, por exemplo.
Um recurso pode ser identificado por diversas URIs, mas uma URI endereça apenas um recurso. 
</p>
</div>
</div>

<div id="outline-container-org9612ac2" class="outline-4">
<h4 id="org9612ac2"><span class="section-number-4">3.1.2.</span> Multiplos formatos de representação</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Recurso podem ser representados de diferentes maneiras.
A representação de um recurso é uma amostra dos valores de suas propriedades em um determinado momento do tempo.
O recurso jamais é acessado diretamente, mas através de uma representação, sendo assim uma URI está sempre associada a pelo menos uma representação.
</p>

<p>
JSON é uma das representações mais utilizadas em Web APIs REST.
JSON é uma forma textual de representação de dados estruturados em uma coleção de pares no formato de chave/valor. A chave sempre é descrita como texto, e o valor pode ser expresso como texto, numero, booleano, nulo, objeto ou uma sequência ordenada de valores.
JSON é muito utilizado no intercâmbio de informações, pois é independente de linguagem de programação, de fácil criação, manipulação e análise. Apesar da popularidade do JSON, apropriado para representar informações que serão processadas por outras aplicações, é comum Web APIs manipularem recursos representados em HTML para serem consumidos diretamente por seres humanos. 
</p>
</div>
</div>

<div id="outline-container-orga4b00e9" class="outline-4">
<h4 id="orga4b00e9"><span class="section-number-4">3.1.3.</span> Interface Uniforme</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Um dos principais princípios arquiteturais REST é o estabelecimento de uma interface uniforme entre cliente e servidor. O uso de uma interface uniforme proporciona uma arquitetura simplificada e desacoplada.
Uma das formas para estabelecer uma interface uniforme é respeitar a semântica do protocolo utilizado pelo Web Service.
O HTTP é o protocolo mais utilizados em Web APis REST, e respeitar a semântica do protocolo significa utilizar adequadamente os seus verbos e códigos de mensagens. Os verbos HTTP mais utilizados são:
• GET - Obter a representação de um recurso;
• POST - Criar um novo recurso;
• PUT - Alterar um recurso;
• DELETE - Remover um recurso.
</p>

<p>
Espera-se que os significados dos verbos HTTP sejam respeitados, empregando o verbo adequado para cada ação, embora muitas implementações REST negligenciam esta restrição e utilizam GET para obter, criar, alterar e remover recursos, dentre outras combinações.
Outra restrição imposta pelo REST é a correta utilização de códigos de status ou mensagens.
Todas as requisições tratadas pelo servidor recebem um código de status, que informa ao cliente o resultado da requisição. Os códigos de status possuem tamanho fixo de três dígitos e estão organizados da seguinte forma:
</p>

<ul class="org-ul">
<li>1XX - Informações;</li>
<li>2XX - Sucessos;</li>
<li>3XX - Redirecionamentos;</li>
<li>4XX - Erros causados pelo cliente;</li>
<li>5XX - Erros causados no servidor.</li>
</ul>
</div>
</div>
