articles/2021-SOA-Rest-Micro/SOA-Rest-Micro.org
*** Mensagens autocontidas
Outra restrição arquitetural exige que as requisições contenham todas as informações necessárias para sua execução, sem recorrer a dados armazenados em sessões do usuário.
Não é esperado que o servidor mantenha dados na sessão do usuário, tornando a aplicação stateless. É responsabilidade da aplicação cliente manter o estado dos recursos para o usuário final, ficando o servidor com a responsabilidade de disponibilizar representações de recursos e alterar seus estados.
O comportamento stateless implica que o servidor não deve manter nenhuma informação sobre as requisições realizadas.
O envio de todas as informações necessárias para a execução das requisições, somado à utilização correta do protocolo utilizado pelo Web Service resulta em mensagens auto-descritivas, outro importante princípio arquitetural REST.

*** HATEOAS
O estilo arquitetural REST adota o princípio HATEOAS (Hypermedia as the Engine of Application State).
Este princípio define que as mudanças de estado da aplicação devem ser guiadas através de controles hipermídia.
No contexto de REST, entende-se por aplicação o conjunto de recursos e seus respectivos estados manipulados por um cliente.
Controles hipermídia podem assumir a forma de links, que guiam a navegação entre diferentes recursos. Um formulários HTML é outro exemplo de controle hipermídia, que oferece mecanismos para criação ou alteração de informações.
HATEOAS implica que as representações de recursos, além de conter dados, devem conter controles hipermídia com transições válidas para um determinado estado.


** Arquitetura de microseviços



  

* Conclusões
 Web APIs podem utilizar diversos protocolos de comunicação.
 Entretanto, o mais utilizado é o HTTP. Ao adotar REST, a Web API deve obedecer a semântica do protocolo escolhido.
 Tratando-se do HTTP, deve-se utilizar corretamente os verbos (GET, POST, PUT e DELETE) e os códigos de notificação de mensagens.
 Além de utilizar o protocolo HTTP como base, as implementações de Web APIs utilizam a Web como infraestrutura de desenvolvimento.
 Utilizar a Web como infraestrutura implica a adoção tecnologias padronizadas, bem como o emprego correto dos protocolos usados pelas aplicações.

Ocorre neste momento uma mudança de perspectiva, onde o foco deixa de ser em serviços e passa a ser em representações de recursos e suas transições de estado.
As transições são as requisições que alteram o estado de um recurso, embora nem todas as requisições causem mudança de estado.
Quando o Web Service obedece a semântica do protocolo HTTP, fica mais fácil identificar a natureza das requisições, facilitando a utilização por parte das aplicações clientes.

Microservices estão substituindo as aplicações monolíticas para tornar os serviços mais coesos e menos acoplados, através da decomposição das funcionalidades e dados em diversos componentes.
Juntamente com os benefícios provenientes da adoção da arquitetura de microservices acompanham as complexidades acidentais.
Na mesma proporção que a quebra das funcionalidades facilita o desenvolvimento isolado dos componentes resultantes, a comunicação e a colaboração entre as partes é significativamente mais complexa.


 
